const { bot } = require("./config.js");
const { Scenes } = require("telegraf");

bot.action("infoTickers", (ctx) => {
  ctx.replyWithHTML(
    "Користувач вводить символ за яким він бажає отримати детальну інформацію. Символ виглядає як пара двох символів, альткоїна(наприклад BTC) та стейблкоїна(USDT). Стейблкоїн USDT постійно дорівнюї 1 долар США, це для того щоб легче та краще розуміти ціну визначеної криптовалюти. Після введення символа, кортисувач отримує інформації, у вигляді:\nСимвол;\nОстання ціна криптовалюти;\nРинкова ціна 24 години тому;\nВідсоткова ринкова зміна ціни за 24 години;\nНайвища ціна за 24 години;\nНайнижча ціна за 24 години;\nОб'єм торгівлі за 24 години\nОборот торгівлі за 24 години.\n\n"
  );
});
bot.action("infoOrderBook", (ctx) => {
  ctx.replyWithHTML(
    "Order Book(книга замовлень) - це список замовлень, що створюють користувачі за визначеної ціної та об'ємом, які виражаються у $ США. У боті користувач може запросити книгу замовлень за визначеним символом та отримати по 25 ордерів(за замовчуванням, або більше, якщо введе запит за спеціальним форматом) на купівлю та продаж. "
  );
});
bot.action("infoQueryKline", (ctx) => {
  ctx.replyWithHTML(
    "Query Kline(клин запит) - це функція яка виводить ціну за символом, яка була визначена з якимось інтервалом часу. Користувач робить запит за параметрами які йому потрібні. Перший з них це символ для пошуку. Другий це interval(інтервал часу), тобто, це який проміжок часу між якими буде визначатись ціни для виведення, наприклад, інтервал у 60 секунд, це значить, що різница у часі між першої ціною і другої буде у 60 секунд. Третій параметр - це ліміт запитів, він не є обов'язковим, бо складає за замовчуванням 25 запитів, але користувач може його змінити(не може перевищувати 100).");
});
bot.action("infoAmendOrder", (ctx) => {
  ctx.replyWithHTML("Amend Order(зміна замовлення) - це функція, завдяки якої можна змінювати вже існуюче замовлення, вона працює лише на ринку деривативів. Вона може приймати 6 параметрів запиту, а саме: символ, номер замовлення, кількість, ціна, ціна отримання прибутків та ціна зупинки збитків. Поля <b>символ та номер замовлення є обов'язковими для заповнення</b>, усі інші не є обов'язковими, тому якщо немає потреби якийсь з них заповнювати, тому будь-ласка на місці якогось з параметрів введіть значення <b>0</b>\nСимвол(symbol) - це параметр за яким буде відбуватися пошук, у якого саме символа і буде відбуватися зміна замовлення.\nНомер замовлення(orderId) - даний параметр потрібен для уточнення, яке саме замовлення буде змінюватись\nКількість(quantity) - це поле, при введенні якого можна змінювати кількість самого замовлення\nЦіна(price) - це поле, при введенні якого буде змінюватись ціна замовлення\nЦіна отримання прибутків(takeProfit) - це поле, при введенні якого буде змінюватись ціна отримання прибутків\nЦіна стопу збитків(stopLoss) - це поле, при введенні якого буде змінюватись ціна стопу збитків");
})
bot.action("infoPlaceOrder", (ctx) => {
  ctx.replyWithHTML("Place Order(розміщування замовлення) - це функція, завдяки якої можна розміщувати замовлення на ринках споту та деривативів криптобіржі ByBit. На ринку деривативів вона може приймати 7 параметрів запиту, а саме: символ, бік, тип замовлення, кількість, ціну, ціна отримання прибутків та ціна стопу збитків. З ринком споту параметри майже співпадать, окрім того, що немає параметрів ціни отримання прибутків та ціни стопу збитків.\n\n\t\t\tСимвол(symbol) - це параметр за яким буде відбуватися пошук, у якого саме символа і буде відбуватися зміна замовлення.\n\t\t\tБік замовлення(side) - може бути Buy або Sell, тобто замовлення може бути або на купівлю, або на продаж.\n\t\t\tТип замовлення (orderType) - може бути лише Market(ринковий) або Limit(лімітний). Якщо обираєте Market, тоді наступні поля як price, takeProfit та stopLoss треба заповнити значенням <b>0</b>, тому що валюта купляється або продається за поточною ціною потрібної криптовалюти.\n\t\t\tКількість(qty) - кількість замовлення валюти. Якщо обираете тип замовлення <b>Market</b>, тоді дане поле дорівнює вартістю замовлення в USDT\n\t\t\tЦіна(price) - ціна замовлення, якщо це купівля то вона буде в USDT, якщо на продаж, то в тій валюті яку плануєте продавати. Якщо обираєте тип замовлення <b>Market</b>, то дане поле треба заповнити значенням <b>0</b>\n\t\t\tЦіна отримання прибутків - поле яке працює лише на ринку диревативів, спрацьовує коли ціна криптовалюти дійшла до даної ціни і даному випадку користувач отримає прибуток і замовлення закриється.\n\t\t\tЦіна стопу збитків - поле яке працює лише на ринку диревативів, спрацьовує коли ціна криптовалюти дійшла до даної ціни і в даному випадку замовлення закриється зі збитками для користувача.");
});
bot.action("infoCancelOrder", (ctx) => {
  ctx.replyWithHTML("Cancel Order(відміна замовлення) - ця функція яка відміняє замовлення за назвою символа та ідентифікаційним номером самого ордера, який можна отримати з функції GetOpenOrders, але дана функція може відміняти ті ордери, які не були виконані або виконані частично.");
});
bot.action("infoCancelAllOrder", (ctx) => {
  ctx.replyWithHTML("Cancel All Orders(відміна всіх замовлень) - назва функції сама каже за себе, то що вона відміняє усі ордери користувача на ринку диривативів, які не були виконані або виконані частично. На ринку деривативів будуть повертатись ідентифікатори видаленних замовлень, а на ринку споту лише кількість видаленних замовлень за певною криптовалютою.");
});
bot.action("infoGetOpenOrder", (ctx) => {
  ctx.replyWithHTML(
    "Get Open Orders(отримання відкритих замовлень) - ця функція виконує виведення усіх відкритих замовлень користувача за певною криптовалютою на даних момент, вона потребує обов'язкого введення API Key та API Secret юзера, без них даною функцієї не можна буде користуватись."
  );
});
bot.action("infoGetOrdersHistory", (ctx) => {
  ctx.replyWithHTML("Get Orders History(отримати історію замовлень) - ця функція виводить детальну історію замовлень користувача за певною криптовалютою за останні 2 роки, виводитись може максимум 50 записів.");
});
bot.action("infoGetWalletBalance", (ctx) => {
  ctx.replyWithHTML(
    "Get Wallet Balance(отримання балансу гаманця) - ця функція виводить у подробицях баланс певною криптовалюти, або можна вивести усіх криптовалют з балансом користувача. Ця функція буде дуже зручно тим користувачам, у яких досить слабкий зв'язок Інтернету, для того щоб зайти на сайт/додаток біржі ByBit для перегляду балансу свого гаманця."
  );
});

const infoScene = new Scenes.BaseScene('info')

infoScene.enter(ctx => {
  return ctx.replyWithHTML(
    "Натисніть на кнопку потрібної Вам функції, для отримання більш детальної інформації:",
    {
      reply_markup: {
        inline_keyboard: [
          [{ text: "Tickers", callback_data: "infoTickers" }],
          [{ text: "Order Book", callback_data: "infoOrderBook" }],
          [{ text: "Query Kline", callback_data: "infoQueryKline" }],
          [{ text: "Amend Order", callback_data: "infoAmendOrder" }],
          [{ text: "Place Order", callback_data: "infoPlaceOrder" }],
          [{ text: "Cancel Order", callback_data: "infoCancelOrder" }],
          [{ text: "Cancel All Orders", callback_data: "infoCancelAllOrder" }],
          [{ text: "Get Open Orders", callback_data: "infoGetOpenOrders" }],
          [{ text: "Get Orders History", callback_data: "infoGetOrdersHistory" }],
          [{ text: "Get Wallet Balance", callback_data: "infoGetWalletBalance" }],
        ],
      },
    }
  );
})

module.exports = { infoScene }